#+property: header-args:R :session *R* :results output
* README

  Run the following code blocks to understand how (difficult it is) to
  clean arbitrarily formatted text data from the web. Source: Pearson
  (2016).
  
* GET URL

  View web pages with data for download using ~browseURL~
  #+begin_src R :results silent
    browseURL(
      "http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/")
  #+end_src
  
* GET DATA RECORDS

  - Get raw data file using ~download.file~
    #+begin_src R
      URL <- "http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"
      download.file(URL, "UCIautoMpg.txt")
      shell('DIR/W UCIautoMpg.txt')
    #+end_src

    #+RESULTS:
    #+begin_example
    trying URL 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data'
    Content type 'application/x-httpd-php' length 30286 bytes (29 KB)
    downloaded 29 KB
     Volume in drive C is OS
     Volume Serial Number is 0654-135C

     Directory of c:\Users\birkenkrahe\Documents\GitHub\admin\RoamNotes

    UCIautoMpg.txt   
		   1 File(s)         30,684 bytes
		   0 Dir(s)  345,078,173,696 bytes free
    #+end_example

  - View file with ~notepad~ in Windows using ~shell~
    #+begin_src R
      shell('notepad UCIautoMpg.txt')
    #+end_src

  - Read raw data into R data using ~readLines~
    #+begin_src R
      autoMpgRecords <- readLines("UCIautoMpg.txt")
      head(autoMpgRecords,1)
      x <- autoMpgRecords[1]  # store first record in x
      nchar(x) # characters
      substr(x, start=1, stop=56) # numbers
      substr(x, start=57, stop=84) # text
    #+end_src

    #+RESULTS:
    : [1] "18.0   8   307.0      130.0      3504.      12.0   70  1\t\"chevrolet chevelle malibu\""
    : [1] 84
    : [1] "18.0   8   307.0      130.0      3504.      12.0   70  1"
    : [1] "\t\"chevrolet chevelle malibu\""

* GET DATA VARIABLE NAMES

  - Get raw data names file using ~download.file~
    #+begin_src R
      URL1 <- "http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.names"
      download.file(URL1, "UCIautoMpgNames.txt")
      shell("DIR/W UCIautoMpgNames.txt")
    #+end_src

    #+RESULTS:
    #+begin_example
    trying URL 'http://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.names'
    Content type 'application/x-httpd-php' length 1660 bytes
    downloaded 1660 bytes
     Volume in drive C is OS
     Volume Serial Number is 0654-135C

     Directory of c:\Users\birkenkrahe\Documents\GitHub\admin\RoamNotes

    UCIautoMpgNames.txt   
		   1 File(s)          1,705 bytes
		   0 Dir(s)  345,078,149,120 bytes free
    #+end_example

  - View file with ~notepad~ in Windows using ~shell~
    #+begin_src R :results silent
      shell("UCIautoMpgNames.txt")
    #+end_src

  - Read raw data text file into R data using ~readLines~
    #+begin_src R
      autoMpgNames <- readLines("UCIautoMpgNames.txt")
      autoMpgNames[32:44]
    #+end_src

    #+RESULTS:
    #+begin_example
     [1] "7. Attribute Information:"                                    
     [2] ""                                                             
     [3] "    1. mpg:           continuous"                             
     [4] "    2. cylinders:     multi-valued discrete"                  
     [5] "    3. displacement:  continuous"                             
     [6] "    4. horsepower:    continuous"                             
     [7] "    5. weight:        continuous"                             
     [8] "    6. acceleration:  continuous"                             
     [9] "    7. model year:    multi-valued discrete"                  
    [10] "    8. origin:        multi-valued discrete"                  
    [11] "    9. car name:      string (unique for each instance)"      
    [12] ""                                                             
    [13] "8. Missing Attribute Values:  horsepower has 6 missing values"
    #+end_example

* CREATE DATA FRAME

  - Define conversion function ~ConvertAutoMpgRecords~
    #+begin_src R :results silent
      ConvertAutoMpgRecords <- function(rawRecords) {
        noQuotes <- gsub('\"', '', rawRecords)
        n <- length(noQuotes)
        outFrame <- NULL
        for (i in 1:n) {
          x <- noQuotes[i]
          twoParts <- unlist(strsplit(x,split="\t"))
          partOne <- unlist(strsplit(twoParts[1],split="[ ]+"))
          numbers <- as.numeric(partOne)
          upFrame <- data.frame(mpg = numbers[1],
                                cylinders = numbers[2],
                                displacement = numbers[3],
                                horsepower = numbers[4],
                                weight = numbers[5],
                                acceleration = numbers[6],
                                modelYear = numbers[7],
                                origin = numbers[8],
                                carName = twoParts[2])
          outFrame <- rbind.data.frame(outFrame, upFrame)
        }
        return(outFrame)
      }
    #+end_src

  - Convert R data into data frame
    #+begin_src R
      autoMpgFrame <- ConvertAutoMpgRecords(autoMpgRecords)
      head(autoMpgFrame)
    #+end_src

    #+RESULTS:
    #+begin_example
    Warning messages:
    1: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
    2: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
    3: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
    4: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
    5: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
    6: In ConvertAutoMpgRecords(autoMpgRecords) : NAs introduced by coercion
      mpg cylinders displacement horsepower weight acceleration modelYear origin
    1  18         8          307        130   3504         12.0        70      1
    2  15         8          350        165   3693         11.5        70      1
    3  18         8          318        150   3436         11.0        70      1
    4  16         8          304        150   3433         12.0        70      1
    5  17         8          302        140   3449         10.5        70      1
    6  15         8          429        198   4341         10.0        70      1
			carName
    1 chevrolet chevelle malibu
    2         buick skylark 320
    3        plymouth satellite
    4             amc rebel sst
    5               ford torino
    6          ford galaxie 500
    #+end_example

* REFERENCES
 
  - Pearson RK (2016). Exploratory Data Analysis. CRC Press.
